app/views/messages/_form.html.erb

 <div class="field">
   <%= f.input :receiver_id, collection: User.all, label_method: :name %>
---
SELECT "users".* FROM "users"  ORDER BY "users"."name" ASC