app/controllers/messages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
INSERT INTO "messages" ("subject", "body", "receiver_id", "published_at", "sender_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @message = Message.new(message_params)
    @message.sender = current_user
    recipient = User.where(id: params[:receiver_id])
    conversation = current_user.send_message(recipient, params[:message][:body], params[:message][:subject]).conversation
    flash[:success] = "Message has been sent!"
    redirect_to messages_path

    respond_to do |format|
      if @message.save

UPDATE "messages" SET "published_at" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["published_at", "2015-09-15 15:36:00.000000"], ["updated_at", "2015-09-15 15:26:03.778145"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @message.update(message_params)